In [188]:
import pandas as pd
import numpy as np
import pandas_datareader as web

### INTRODUCTION TO PANDAS DATA STRUCTURES:
* [Series](#series)
* [DataFrame](#dataFrame)
* [Index Objects](#indexObjects)

### ESSENTIAL FUNCTIONALITY:
* [Reindexing](#reindexing)
* [Dropping Entries from an Axis](#DroppingEntries)
* [Indexing, Selection and Filtering](#selectFilter)
* [Integer Indexes](#integerIndexes)
* [Arithmetic and Data Alignment](#arithmetic)
* [Function Application and Mapping](#mapping)
* [Sorting and Ranking](#sorting)
* [Axis Indexes with Duplicate Labels](#axisIndexes)

### SUMMARIZING AND COMPUTING DESCRIPTIVE STATISTICS:
* [Correlation and Covariance](#corrcov)
* [Unique Values, Value Counts and Membership](#uniqueValueCounts)

# INTRODUCTION TO PANDAS DATA STRUCTURES

## Series <a class="anchor" id="series"></a>

In [3]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4,7,-5,3],index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [11]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
obj2['a']

4

In [14]:
obj2[['a','b','d']]

a    4
b    7
d    3
dtype: int64

In [15]:
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

In [16]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [19]:
'b' in obj2

True

In [20]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [23]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [32]:
states = ['Ohio','Texas','Oregon','California']

In [33]:
obj4 = pd.Series(sdata,index=states)
obj4

Ohio          35000.0
Texas         71000.0
Oregon        16000.0
California        NaN
dtype: float64

In [34]:
pd.isnull(obj4)

Ohio          False
Texas         False
Oregon        False
California     True
dtype: bool

In [35]:
obj4.notnull()

Ohio           True
Texas          True
Oregon         True
California    False
dtype: bool

In [36]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
obj4.name = 'Population'
obj4.index.name = 'state'
obj4

state
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
California        NaN
Name: Population, dtype: float64

In [40]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [41]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame <a class="anchor" id="dataFrame"></a>

In [2]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year': [2000,2001,2002,2000,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [3]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9
5  Nevada  2002  3.2

In [4]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9

In [5]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2000  Nevada  2.4
4  2001  Nevada  2.9
5  2002  Nevada  3.2

In [13]:
pd.DataFrame(data,columns=['year','state','pop'],index=['one','two','three','four','five','six'])

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2000  Nevada  2.4
five   2001  Nevada  2.9
six    2002  Nevada  3.2

In [14]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [15]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [17]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [20]:
frame.loc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [22]:
frame['debt'] = 16.5
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2000  2.4  16.5
4  Nevada  2001  2.9  16.5
5  Nevada  2002  3.2  16.5

In [25]:
frame['debt'] = np.arange(6.)
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2000  2.4   3.0
4  Nevada  2001  2.9   4.0
5  Nevada  2002  3.2   5.0

In [26]:
val = pd.Series([-1.2,-1.5,-1.7], index=[3,4,5])
val

3   -1.2
4   -1.5
5   -1.7
dtype: float64

In [28]:
frame['debt'] = val
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2000  2.4  -1.2
4  Nevada  2001  2.9  -1.5
5  Nevada  2002  3.2  -1.7

In [29]:
frame['eastern'] = frame.state == 'Ohio'
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7   NaN     True
2    Ohio  2002  3.6   NaN     True
3  Nevada  2000  2.4  -1.2    False
4  Nevada  2001  2.9  -1.5    False
5  Nevada  2002  3.2  -1.7    False

In [30]:
del frame['eastern']
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2000  2.4  -1.2
4  Nevada  2001  2.9  -1.5
5  Nevada  2002  3.2  -1.7

In [15]:
pop = {'Nevada' : {2001:2.4,2002:2.9},
      'Ohio': {2000: 1.5,2001: 1.7,2002: 3.6}}

In [16]:
frame2 = pd.DataFrame(pop)
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [39]:
frame2.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [ ]:
pdata = {'Ohio':frame['Ohio'][:-1]}

In [41]:
frame2['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [45]:
frame2.index.name = 'year'
frame2.columns.name = 'state'

In [46]:
frame2

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [54]:
frame2.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [51]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2000  2.4  -1.2
4  Nevada  2001  2.9  -1.5
5  Nevada  2002  3.2  -1.7

In [52]:
frame.values

array([['Ohio', 2000, 1.5, nan],
       ['Ohio', 2001, 1.7, nan],
       ['Ohio', 2002, 3.6, nan],
       ['Nevada', 2000, 2.4, -1.2],
       ['Nevada', 2001, 2.9, -1.5],
       ['Nevada', 2002, 3.2, -1.7]], dtype=object)

# Index Objects <a class="anchor" id="indexObjects"></a>

In [11]:
obj = pd.Series(range(3),index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [5]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [13]:
obj2 = pd.Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [14]:
obj2.index is labels

True

In [17]:
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [18]:
frame2.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [19]:
'Ohio' in frame2.columns

True

In [22]:
dup_labels = pd.Index(['foo','foo'])
dup_labels

Index(['foo', 'foo'], dtype='object')

# ESSENTIAL FUNCTIONALITY

## Reindexing <a class="anchor" id="reindexing"></a>

In [2]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [7]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [12]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','d','c'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
d     3      4           5
c     6      7           8

In [13]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   6.0    7.0         8.0
d   3.0    4.0         5.0

In [14]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
d      4   NaN           5
c      7   NaN           8

## Dropping Entries from an Axis <a class="anchor" id="DroppingEntries"></a>

In [41]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [19]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [20]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [21]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['one','two','three','four'],
                    columns=['Ohio','Colorado','Utah','New York'])

In [22]:
data

       Ohio  Colorado  Utah  New York
one       0         1     2         3
two       4         5     6         7
three     8         9    10        11
four     12        13    14        15

In [28]:
data.drop(['Ohio','Colorado'],axis=1)

       Utah  New York
one       2         3
two       6         7
three    10        11
four     14        15

In [33]:
data.drop('two',axis='rows')

       Ohio  Colorado  Utah  New York
one       0         1     2         3
three     8         9    10        11
four     12        13    14        15

In [34]:
data.drop(['two','four'],axis='rows')

       Ohio  Colorado  Utah  New York
one       0         1     2         3
three     8         9    10        11

In [35]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [42]:
obj.drop('c',inplace=True)

In [43]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## Indexing, Selection and Filtering <a class="anchor" id="selectFilter"></a>

In [6]:
obj = pd.Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [7]:
obj['b']

1.0

In [8]:
obj[1]

1.0

In [9]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [10]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [11]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [12]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [13]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [14]:
obj[:1]

a    0.0
dtype: float64

In [15]:
obj[:'b']

a    0.0
b    5.0
dtype: float64

In [16]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio','Colorado','Utah','New York'],
                   columns=['one','two','three','four'])

In [17]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [19]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [64]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [65]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [23]:
_filter = data < 5
_filter

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [22]:
data[_filter] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Selection with loc and iloc

In [25]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [27]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [28]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [30]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [31]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [36]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## Integer Indexes <a class="anchor" id="integerIndexes"></a>

In [38]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [40]:
# ser[-1] throws an error.

In [43]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [42]:
ser2[-1]

2.0

In [44]:
ser[:1]

0    0.0
dtype: float64

In [45]:
ser.iloc[:1]

0    0.0
dtype: float64

In [46]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

## Arithmetic and Data Alignment <a class="arithmetic" id="series"></a>

In [50]:
s1=pd.Series(np.random.randn(4),index=['a','c','d','e'])
s1

a    1.751410
c   -0.497668
d   -0.718832
e   -0.383720
dtype: float64

In [51]:
s2=pd.Series(np.random.randn(5),index=['a','c','e','f','g'])
s2

a    1.709522
c    1.572606
e   -1.684908
f    1.847547
g    0.927388
dtype: float64

In [52]:
s1 + s2

a    3.460932
c    1.074937
d         NaN
e   -2.068628
f         NaN
g         NaN
dtype: float64

In [59]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),
                   columns=list('bcd'),
                   index=['Ohio','Texas','Colorado'])

In [60]:
df2 = pd.DataFrame(np.arange(12.).reshape(4,3),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])

In [61]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [62]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [63]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [64]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3,4]})

In [65]:
df1

   A
0  1
1  2

In [66]:
df2

   B
0  3
1  4

In [67]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

Arithmetic methods with fill values

In [69]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4),
                   columns=list('bcde'))
df1

     b    c     d     e
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [71]:
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),
                   columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [75]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [77]:
df1

     b    c     d     e
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [78]:
df1+df2

    a     b     c     d     e
0 NaN   1.0   3.0   5.0   7.0
1 NaN   NaN  12.0  14.0  16.0
2 NaN  19.0  21.0  23.0  25.0
3 NaN   NaN   NaN   NaN   NaN

In [79]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   1.0   3.0   5.0   7.0
1   5.0   4.0  12.0  14.0  16.0
2  10.0  19.0  21.0  23.0  25.0
3  15.0  16.0  17.0  18.0  19.0

In [80]:
1/df1

       b         c         d         e
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [83]:
df1.rdiv(1)

       b         c         d         e
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [85]:
df1.reindex(columns=df2.columns,fill_value=0,index=df2.index)

     a    b    c     d     e
0  0.0  0.0  1.0   2.0   3.0
1  0.0  4.0  5.0   6.0   7.0
2  0.0  8.0  9.0  10.0  11.0
3  0.0  0.0  0.0   0.0   0.0

### Operations between DataFrame and Series

In [86]:
arr = np.arange(12.).reshape((3,4))

In [87]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [88]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [90]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3))
                    ,columns=list('bde')
                    ,index=['Utah','Ohio','Texas','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [91]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [92]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [94]:
series2 = pd.Series(range(3),index=list('bef'))
series2

b    0
e    1
f    2
dtype: int64

In [95]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [97]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [99]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping <a class="anchor" id="mapping"></a>

In [104]:
frame = pd.DataFrame(np.random.randn(4,3)
                    ,columns=list('bde')
                    ,index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    0.419490 -0.454173 -1.344526
Ohio   -1.392939  0.558074  0.514591
Texas  -0.208491  0.251314  1.796660
Oregon  0.842750 -1.166336 -0.178096

In [105]:
np.abs(frame)

               b         d         e
Utah    0.419490  0.454173  1.344526
Ohio    1.392939  0.558074  0.514591
Texas   0.208491  0.251314  1.796660
Oregon  0.842750  1.166336  0.178096

In [107]:
f = lambda x: x.max() - x.min()

In [113]:
frame.apply(f,axis=1)

Utah      1.764016
Ohio      1.951013
Texas     2.005151
Oregon    2.009085
dtype: float64

In [119]:
_format = lambda x: '%.2f' % x

In [118]:
'%.2f' % 4.26862545464

'4.27'

In [125]:
frame.applymap(_format)

            b      d      e
Utah     0.42  -0.45  -1.34
Ohio    -1.39   0.56   0.51
Texas   -0.21   0.25   1.80
Oregon   0.84  -1.17  -0.18

In [124]:
frame['e'].map(_format)

Utah      -1.34
Ohio       0.51
Texas      1.80
Oregon    -0.18
Name: e, dtype: object

In [130]:
frame.loc['Ohio'].map(_format)

b    -1.39
d     0.56
e     0.51
Name: Ohio, dtype: object

## Sorting and Ranking <a class="anchor" id="sorting"></a>

In [132]:
obj = pd.Series(range(4),index=list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int64

In [133]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [134]:
frame = pd.DataFrame(np.arange(8).reshape(2,4)
                    ,columns=list('dabc')
                    ,index=['one','two'])
frame

     d  a  b  c
one  0  1  2  3
two  4  5  6  7

In [135]:
frame.sort_index()

     d  a  b  c
one  0  1  2  3
two  4  5  6  7

In [136]:
frame.sort_index(axis=1)

     a  b  c  d
one  1  2  3  0
two  5  6  7  4

In [137]:
frame.sort_index(axis=1,ascending=False)

     d  c  b  a
one  0  3  2  1
two  4  7  6  5

In [138]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [139]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [141]:
obj = pd.Series([1,np.nan,2,np.nan,3])
obj

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [142]:
obj.sort_values()

0    1.0
2    2.0
4    3.0
1    NaN
3    NaN
dtype: float64

In [143]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [145]:
frame.sort_values(by='b',ascending=False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [147]:
frame.sort_values(by=['a','b'],ascending=False)

   b  a
1  7  1
3  2  1
0  4  0
2 -3  0

In [151]:
obj = pd.DataFrame([10,1,7,5,6,6,7])
obj

    0
0  10
1   1
2   7
3   5
4   6
5   6
6   7

In [155]:
obj.rank()

     0
0  7.0
1  1.0
2  5.5
3  2.0
4  3.5
5  3.5
6  5.5

In [156]:
obj.rank(method='first')

     0
0  7.0
1  1.0
2  5.0
3  2.0
4  3.0
5  4.0
6  6.0

In [157]:
frame = pd.DataFrame({'b':np.random.randn(4)
                     ,'a':np.random.randn(4)
                     ,'c':np.random.randn(4)})
frame

          b         a         c
0  1.106525  0.803897  0.742458
1 -1.897767  0.623541  1.381257
2 -0.975298 -0.763170  0.116914
3  0.145456  0.266339 -0.601474

In [163]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0
3  2.0  3.0  1.0

## Axis Indexes with Duplicate Labels <a class="anchor" id="axisIndexes"></a>

In [164]:
obj = pd.Series(np.arange(5),index=list('aabbc'))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [167]:
obj.is_unique

True

In [169]:
obj['a']

a    0
a    1
dtype: int32

# SUMMARIZING AND COMPUTING DESCRIPTIVE STATISTICS:

In [170]:
df = pd.DataFrame([[1.5,np.nan]
                 ,[7.5,-4.5]
                 ,[np.nan,np.nan]
                 ,[0.75,-1.3]]
                 ,index=['a','b','c','d']
                 ,columns=['one','two'])

In [171]:
df

    one  two
a  1.50  NaN
b  7.50 -4.5
c   NaN  NaN
d  0.75 -1.3

In [172]:
df.sum()

one    9.75
two   -5.80
dtype: float64

In [174]:
df.sum(axis=1,skipna=0)

a     NaN
b    3.00
c     NaN
d   -0.55
dtype: float64

In [178]:
df.idxmax()

one    b
two    d
dtype: object

In [179]:
df.cumsum()

    one  two
a  1.50  NaN
b  9.00 -4.5
c   NaN  NaN
d  9.75 -5.8

In [180]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.250000 -2.900000
std    3.699662  2.262742
min    0.750000 -4.500000
25%    1.125000 -3.700000
50%    1.500000 -2.900000
75%    4.500000 -2.100000
max    7.500000 -1.300000

In [183]:
obj = pd.Series(list('aabc')*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [186]:
obj.describe() #Non-numeric data

count     16
unique     3
top        a
freq       8
dtype: object

## Correlation and Covariance <a class="anchor" id="corrcov"></a>

In [191]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [205]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker,data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker,data in all_data.items()})

In [194]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2017-03-27   33.253323  130.279358   60.769852   819.510010
2017-03-28   33.942551  130.834183   60.947220   820.919983
2017-03-29   34.018082  130.406876   61.115246   831.409973
2017-03-30   33.973232  130.346878   61.339268   831.500000
2017-03-31   33.909508  130.556778   61.479313   829.559998
...                ...         ...         ...          ...
2022-03-18  163.979996  128.759995  300.429993  2736.030029
2022-03-21  165.380005  128.100006  299.160004  2729.570068
2022-03-22  168.820007  129.059998  304.059998  2805.550049
2022-03-23  170.210007  128.300003  299.489990  2770.070068
2022-03-24  172.035004  128.839996  301.510010  2803.840088

[1259 rows x 4 columns]

In [195]:
returns = price.pct_change()

In [196]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-03-18  0.020919  0.006252  0.017648  0.016352
2022-03-21  0.008538 -0.005126 -0.004227 -0.002361
2022-03-22  0.020801  0.007494  0.016379  0.027836
2022-03-23  0.008234 -0.005889 -0.015030 -0.012646
2022-03-24  0.010722  0.004209  0.006745  0.012191

In [200]:
returns.MSFT.corr(returns.IBM)

0.4816819893270069

In [201]:
returns.MSFT.cov(returns.IBM)

0.00014382064360866792

In [202]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.429173  0.745587  0.666103
IBM   0.429173  1.000000  0.481682  0.455270
MSFT  0.745587  0.481682  1.000000  0.785763
GOOG  0.666103  0.455270  0.785763  1.000000

In [203]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000381  0.000140  0.000259  0.000229
IBM   0.000140  0.000281  0.000144  0.000134
MSFT  0.000259  0.000144  0.000318  0.000247
GOOG  0.000229  0.000134  0.000247  0.000310

In [204]:
returns.corrwith(returns.IBM)

AAPL    0.429173
IBM     1.000000
MSFT    0.481682
GOOG    0.455270
dtype: float64

In [206]:
returns.corrwith(volume)

AAPL   -0.082601
IBM    -0.129358
MSFT   -0.068517
GOOG   -0.091293
dtype: float64

## Unique Values, Value Counts and Membership <a class="anchor" id="uniqueValueCounts"></a>

In [207]:
obj = pd.Series(list('cadaabbcc'))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [209]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [210]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [213]:
pd.value_counts(obj.values,sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [214]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [216]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4]
                   ,'Qu2':[2,3,1,3,3]
                   ,'Qu3':[1,2,5,1,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    2
2    4    1    5
3    3    3    1
4    4    3    4

In [218]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  2.0
2  0.0  1.0  1.0
3  2.0  3.0  0.0
4  2.0  0.0  1.0
5  0.0  0.0  1.0